using tyuiu.cources.programming.interfaces.Sprint2;

namespace Tyuiu.YushkovaES.Sprint2.Task2.V23.Lib
{
    public class DataService : ISprint2Task2V23
    {
        public bool CheckDotInShadedArea(int x, int y)
        {
            return
         //Верхний левый прямоугольник
         (x >= 3 && x <= 5 && y >= 3 && y <= 5) ||
         //Правый верхний прямоугольник
         (x >= 9 && x <= 12 && y >= 3 && y <= 4) ||
         //Большой центральный 
         (x >= 7 && x <= 12 && y >= 5 && y <= 11) ||
         //Точка между правым и левым верхним
         (x == 6 && y == 5) ||
         //Правый прямоугольник
         (x == 13 && y >= 6 && y <= 8) ||
         //Левый прямоугольник вертикальный
         (x == 6 && y >= 9 && y <= 11) ||
         //Левый горизонтальный прямоугольник
         (x >= 3 && x <= 5 && y == 11) ||
         // Нижний горизонтальный прямоугольник
         (x >= 7 && x <= 10 && y == 12) ||
         // 2 нижний прямоугольник
         (x >= 12 && x <= 13 && y == 12) ||
         // Точка последняя
         (x == 13 && y == 11);






        }
    }
}
